pkwasniok/avr-db-template/lib/atpack/avrasm/inc/AVR64DU32def.inc
.equ CCL_CTRLA = 0x01C0                  ; Control Register A
.equ CCL_SEQCTRL0 = 0x01C1               ; Sequential Control 0
.equ CCL_SEQCTRL1 = 0x01C2               ; Sequential Control 1
.equ CCL_INTCTRL0 = 0x01C5               ; Interrupt Control 0
.equ CCL_INTFLAGS = 0x01C7               ; Interrupt Flags
.equ CCL_LUT0CTRLA = 0x01C8              ; LUT 0 Control A
.equ CCL_LUT0CTRLB = 0x01C9              ; LUT 0 Control B
.equ CCL_LUT0CTRLC = 0x01CA              ; LUT 0 Control C
.equ CCL_TRUTH0 = 0x01CB                 ; Truth 0
.equ CCL_LUT1CTRLA = 0x01CC              ; LUT 1 Control A
.equ CCL_LUT1CTRLB = 0x01CD              ; LUT 1 Control B
.equ CCL_LUT1CTRLC = 0x01CE              ; LUT 1 Control C
.equ CCL_TRUTH1 = 0x01CF                 ; Truth 1
.equ CCL_LUT2CTRLA = 0x01D0              ; LUT 2 Control A
.equ CCL_LUT2CTRLB = 0x01D1              ; LUT 2 Control B
.equ CCL_LUT2CTRLC = 0x01D2              ; LUT 2 Control C
.equ CCL_TRUTH2 = 0x01D3                 ; Truth 2
.equ CCL_LUT3CTRLA = 0x01D4              ; LUT 3 Control A
.equ CCL_LUT3CTRLB = 0x01D5              ; LUT 3 Control B
.equ CCL_LUT3CTRLC = 0x01D6              ; LUT 3 Control C
.equ CCL_TRUTH3 = 0x01D7                 ; Truth 3

;*************************************************************************
;** CLKCTRL - Clock controller
;*************************************************************************

.equ CLKCTRL_MCLKCTRLA = 0x0060          ; MCLK Control A
.equ CLKCTRL_MCLKCTRLB = 0x0061          ; MCLK Control B
.equ CLKCTRL_MCLKCTRLC = 0x0062          ; MCLK Control C
.equ CLKCTRL_MCLKINTCTRL = 0x0063        ; MCLK Interrupt Control
.equ CLKCTRL_MCLKINTFLAGS = 0x0064       ; MCLK Interrupt Flags
.equ CLKCTRL_MCLKSTATUS = 0x0065         ; MCLK Status
.equ CLKCTRL_MCLKTIMEBASE = 0x0066       ; Timebase
.equ CLKCTRL_OSCHFCTRLA = 0x0068         ; OSCHF Control A
.equ CLKCTRL_OSCHFTUNE = 0x0069          ; OSCHF Tune
.equ CLKCTRL_OSCHFSTATUS = 0x006A        ; OSCHF Status
.equ CLKCTRL_OSC32KCTRLA = 0x0078        ; OSC32K Control A
.equ CLKCTRL_XOSC32KCTRLA = 0x007C       ; XOSC32K Control A
.equ CLKCTRL_XOSCHFCTRLA = 0x0080        ; XOSCHF Control A
.equ CLKCTRL_USBPLLSTATUS = 0x0085       ; PLL Status

;*************************************************************************
;** CPU - CPU
;*************************************************************************

.equ CPU_CCP = 0x0034                    ; Configuration Change Protection
.equ CPU_RAMPZ = 0x003B                  ; Extended Z-pointer Register
.equ CPU_SP = 0x003D                     ; Stack Pointer
.equ CPU_SPL = 0x003D                    ; Stack Pointer low byte
.equ CPU_SPH = 0x003E                    ; Stack Pointer hi byte
.equ CPU_SREG = 0x003F                   ; Status Register

;*************************************************************************
;** CPUINT - Interrupt Controller
;*************************************************************************

.equ CPUINT_CTRLA = 0x0110               ; Control A
.equ CPUINT_STATUS = 0x0111              ; Status
.equ CPUINT_LVL0PRI = 0x0112             ; Interrupt Level 0 Priority
.equ CPUINT_LVL1VEC = 0x0113             ; Interrupt Level 1 Priority Vector

;*************************************************************************
;** CRCSCAN - CRCSCAN
;*************************************************************************

.equ CRCSCAN_CTRLA = 0x0120              ; Control A
.equ CRCSCAN_CTRLB = 0x0121              ; Control B
.equ CRCSCAN_STATUS = 0x0122             ; Status

;*************************************************************************
;** EVSYS - Event System
;*************************************************************************

.equ EVSYS_SWEVENTA = 0x0200             ; Software Event A
.equ EVSYS_CHANNEL0 = 0x0210             ; Multiplexer Channel 0
.equ EVSYS_CHANNEL1 = 0x0211             ; Multiplexer Channel 1
.equ EVSYS_CHANNEL2 = 0x0212             ; Multiplexer Channel 2
.equ EVSYS_CHANNEL3 = 0x0213             ; Multiplexer Channel 3
.equ EVSYS_CHANNEL4 = 0x0214             ; Multiplexer Channel 4
.equ EVSYS_CHANNEL5 = 0x0215             ; Multiplexer Channel 5
.equ EVSYS_USERCCLLUT0A = 0x0220         ; CCL0 Event A
.equ EVSYS_USERCCLLUT0B = 0x0221         ; CCL0 Event B
.equ EVSYS_USERCCLLUT1A = 0x0222         ; CCL1 Event A
.equ EVSYS_USERCCLLUT1B = 0x0223         ; CCL1 Event B
.equ EVSYS_USERCCLLUT2A = 0x0224         ; CCL2 Event A
.equ EVSYS_USERCCLLUT2B = 0x0225         ; CCL2 Event B
.equ EVSYS_USERCCLLUT3A = 0x0226         ; CCL3 Event A
.equ EVSYS_USERCCLLUT3B = 0x0227         ; CCL3 Event B
.equ EVSYS_USERADC0START = 0x0228        ; ADC0
.equ EVSYS_USEREVSYSEVOUTA = 0x0229      ; EVOUTA
.equ EVSYS_USEREVSYSEVOUTD = 0x022A      ; EVOUTD
.equ EVSYS_USEREVSYSEVOUTF = 0x022B      ; EVOUTF
.equ EVSYS_USERUSART0IRDA = 0x022C       ; USART0
.equ EVSYS_USERUSART1IRDA = 0x022D       ; USART1
.equ EVSYS_USERTCA0CNTA = 0x022E         ; TCA0 Event A
.equ EVSYS_USERTCA0CNTB = 0x022F         ; TCA0 Event B
.equ EVSYS_USERTCB0CAPT = 0x0230         ; TCB0 Event A
.equ EVSYS_USERTCB0COUNT = 0x0231        ; TCB0 Event B
.equ EVSYS_USERTCB1CAPT = 0x0232         ; TCB1 Event A
.equ EVSYS_USERTCB1COUNT = 0x0233        ; TCB1 Event B

;*************************************************************************
;** FUSE - Fuses
;*************************************************************************

.equ FUSE_WDTCFG = 0x1050                ; Watchdog Configuration
.equ FUSE_BODCFG = 0x1051                ; BOD Configuration
.equ FUSE_OSCCFG = 0x1052                ; Oscillator Configuration
.equ FUSE_SYSCFG0 = 0x1055               ; System Configuration 0
.equ FUSE_SYSCFG1 = 0x1056               ; System Configuration 1
.equ FUSE_CODESIZE = 0x1057              ; Code Section Size
.equ FUSE_BOOTSIZE = 0x1058              ; Boot Section Size
.equ FUSE_PDICFG = 0x105A                ; Programming and Debugging Interface Configuration
.equ FUSE_PDICFGL = 0x105A               ; Programming and Debugging Interface Configuration low byte
.equ FUSE_PDICFGH = 0x105B               ; Programming and Debugging Interface Configuration hi byte

;*************************************************************************
;** GPR - General Purpose Registers
;*************************************************************************

.equ GPR_GPR0 = 0x001C                   ; General Purpose Register 0
.equ GPR_GPR1 = 0x001D                   ; General Purpose Register 1
.equ GPR_GPR2 = 0x001E                   ; General Purpose Register 2
.equ GPR_GPR3 = 0x001F                   ; General Purpose Register 3

;*************************************************************************
;** LOCK - Lockbits
;*************************************************************************

.equ LOCK_KEY = 0x1040                   ; Lock Key Bits
.equ LOCK_KEY0 = 0x1040                  ; Lock Key Bits 0
.equ LOCK_KEY1 = 0x1041                  ; Lock Key Bits 1
.equ LOCK_KEY2 = 0x1042                  ; Lock Key Bits 2
.equ LOCK_KEY3 = 0x1043                  ; Lock Key Bits 3

;*************************************************************************
;** NVMCTRL - Non-volatile Memory Controller
;*************************************************************************

.equ NVMCTRL_CTRLA = 0x1000              ; Control A
.equ NVMCTRL_CTRLB = 0x1001              ; Control B
.equ NVMCTRL_CTRLC = 0x1002              ; Control C
.equ NVMCTRL_INTCTRL = 0x1004            ; Interrupt Control
.equ NVMCTRL_INTFLAGS = 0x1005           ; Interrupt Flags
.equ NVMCTRL_STATUS = 0x1006             ; Status
.equ NVMCTRL_DATA = 0x1008               ; Data
.equ NVMCTRL_DATA0 = 0x1008              ; Data 0
.equ NVMCTRL_DATA1 = 0x1009              ; Data 1
.equ NVMCTRL_DATA2 = 0x100A              ; Data 2
.equ NVMCTRL_DATA3 = 0x100B              ; Data 3
.equ NVMCTRL_ADDR = 0x100C               ; Address
.equ NVMCTRL_ADDR0 = 0x100C              ; Address 0
.equ NVMCTRL_ADDR1 = 0x100D              ; Address 1
.equ NVMCTRL_ADDR2 = 0x100E              ; Address 2
.equ NVMCTRL_ADDR3 = 0x100F              ; Address 3

;*************************************************************************
;** PORTA - I/O Ports
;*************************************************************************

