pkwasniok/avr-db-template/lib/atpack/avrasm/inc/AVR64DU32def.inc
;*************************************************************************
;** USART - Universal Synchronous and Asynchronous Receiver and Transmitter
;*************************************************************************
.equ USART_RXDATAL_offset = 0x00         ; Receive Data Low Byte
.equ USART_RXDATAH_offset = 0x01         ; Receive Data High Byte
.equ USART_TXDATAL_offset = 0x02         ; Transmit Data Low Byte
.equ USART_TXDATAH_offset = 0x03         ; Transmit Data High Byte
.equ USART_STATUS_offset = 0x04          ; Status
.equ USART_CTRLA_offset = 0x05           ; Control A
.equ USART_CTRLB_offset = 0x06           ; Control B
.equ USART_CTRLC_offset = 0x07           ; Control C
.equ USART_BAUD_offset = 0x08            ; Baud Rate
.equ USART_CTRLD_offset = 0x0A           ; Control D
.equ USART_DBGCTRL_offset = 0x0B         ; Debug Control
.equ USART_EVCTRL_offset = 0x0C          ; Event Control
.equ USART_TXPLCTRL_offset = 0x0D        ; IRCOM Transmitter Pulse Length Control
.equ USART_RXPLCTRL_offset = 0x0E        ; IRCOM Receiver Pulse Length Control

;*************************************************************************
;** USB - USB Device Controller
;*************************************************************************
.equ USB_EP_STATUS_offset = 0x00         ; Endpoint Status
.equ USB_EP_CTRL_offset = 0x01           ; Endpoint Control
.equ USB_EP_CNT_offset = 0x02            ; Endpoint Byte Count
.equ USB_EP_DATAPTR_offset = 0x04        ; Endpoint Data Pointer
.equ USB_EP_MCNT_offset = 0x06           ; Endpoint Multi-packet Byte Count
.equ USB_EP_PAIR_OUT_offset = 0x00       ; USB Device Controller OUT
.equ USB_EP_PAIR_IN_offset = 0x08        ; USB Device Controller IN
.equ USB_EP_TABLE_FIFO_offset = 0x00     ; FIFO Pointer Table
.equ USB_EP_TABLE_FIFO_count = 0x20      ; Number of FIFO Pointer Table
.equ USB_EP_TABLE_FIFO_size = 0x01       ; Size of FIFO Pointer Table in bytes
.equ USB_EP_TABLE_FRAMENUM_offset = 0x120 ; FRAMENUM count
.equ USB_EP_TABLE_EP_offset = 0x20       ; USB Device Controller EP
.equ USB_EP_TABLE_EP_count = 0x10        ; Number of USB Device Controller EP
.equ USB_EP_TABLE_EP_size = 0x10         ; Size of USB Device Controller EP in bytes
.equ USB_STATUS_OUTCLR_offset = 0x00     ; Endpoint n OUT Status Clear
.equ USB_STATUS_OUTSET_offset = 0x01     ; Endpoint n OUT Status Set
.equ USB_STATUS_INCLR_offset = 0x02      ; Endpoint n IN Status Clear
.equ USB_STATUS_INSET_offset = 0x03      ; Endpoint n IN Status Set
.equ USB_CTRLA_offset = 0x00             ; Control A
.equ USB_CTRLB_offset = 0x01             ; Control B
.equ USB_BUSSTATE_offset = 0x02          ; Bus State
.equ USB_ADDR_offset = 0x03              ; Address
.equ USB_FIFOWP_offset = 0x04            ; FIFO Write Pointer
.equ USB_FIFORP_offset = 0x05            ; FIFO Read Pointer
.equ USB_EPPTR_offset = 0x06             ; Endpoint Configuration Table Pointer
.equ USB_INTCTRLA_offset = 0x08          ; Interrupt Control A
.equ USB_INTCTRLB_offset = 0x09          ; Interrupt Control B
.equ USB_INTFLAGSA_offset = 0x0A         ; Interrupt Flags A
.equ USB_INTFLAGSB_offset = 0x0B         ; Interrupt Flags B
.equ USB_STATUS_offset = 0x40            ; USB Device Controller STATUS
.equ USB_STATUS_count = 0x10             ; Number of USB Device Controller STATUS
.equ USB_STATUS_size = 0x04              ; Size of USB Device Controller STATUS in bytes

;*************************************************************************
;** USERROW - User Row
;*************************************************************************
.equ USERROW_USERROW_offset = 0x00       ; User Row
.equ USERROW_USERROW_count = 0x200       ; Number of User Row
.equ USERROW_USERROW_size = 0x01         ; Size of User Row in bytes

;*************************************************************************
;** VPORT - Virtual Ports
;*************************************************************************
.equ VPORT_DIR_offset = 0x00             ; Data Direction
.equ VPORT_OUT_offset = 0x01             ; Output Value
.equ VPORT_IN_offset = 0x02              ; Input Value
.equ VPORT_INTFLAGS_offset = 0x03        ; Interrupt Flags

;*************************************************************************
;** VREF - Voltage reference
;*************************************************************************
.equ VREF_ACREF_offset = 0x00            ; ADC0 Reference

;*************************************************************************
;** WDT - Watch-Dog Timer
;*************************************************************************
.equ WDT_CTRLA_offset = 0x00             ; Control A
.equ WDT_STATUS_offset = 0x01            ; Status


; ***** LOCKBIT REGISTER LOCATIONS ***************************************




; ***** FUSE REGISTER LOCATIONS ******************************************




; ***** BIT AND VALUE DEFINITIONS ****************************************


;*************************************************************************
;** AC - Analog Comparator
;*************************************************************************

; AC_CTRLA masks
.equ AC_ENABLE_bm = 0x01                 ; Enable bit mask
.equ AC_ENABLE_bp = 0                    ; Enable bit position
.equ AC_HYSMODE_gm = 0x06                ; Hysteresis Mode group mask
.equ AC_HYSMODE_gp = 1                   ; Hysteresis Mode group position
.equ AC_HYSMODE_0_bm = (1<<1)            ; Hysteresis Mode bit 0 mask
.equ AC_HYSMODE_0_bp = 1                 ; Hysteresis Mode bit 0 position
.equ AC_HYSMODE_1_bm = (1<<2)            ; Hysteresis Mode bit 1 mask
.equ AC_HYSMODE_1_bp = 2                 ; Hysteresis Mode bit 1 position
.equ AC_POWER_gm = 0x18                  ; Power profile group mask
.equ AC_POWER_gp = 3                     ; Power profile group position
.equ AC_POWER_0_bm = (1<<3)              ; Power profile bit 0 mask
.equ AC_POWER_0_bp = 3                   ; Power profile bit 0 position
.equ AC_POWER_1_bm = (1<<4)              ; Power profile bit 1 mask
.equ AC_POWER_1_bp = 4                   ; Power profile bit 1 position
.equ AC_OUTEN_bm = 0x40                  ; Output Pad Enable bit mask
.equ AC_OUTEN_bp = 6                     ; Output Pad Enable bit position
.equ AC_RUNSTDBY_bm = 0x80               ; Run in Standby Mode bit mask
.equ AC_RUNSTDBY_bp = 7                  ; Run in Standby Mode bit position

; AC_MUXCTRL masks
.equ AC_MUXNEG_gm = 0x07                 ; Negative Input MUX Selection group mask
.equ AC_MUXNEG_gp = 0                    ; Negative Input MUX Selection group position
.equ AC_MUXNEG_0_bm = (1<<0)             ; Negative Input MUX Selection bit 0 mask
.equ AC_MUXNEG_0_bp = 0                  ; Negative Input MUX Selection bit 0 position
.equ AC_MUXNEG_1_bm = (1<<1)             ; Negative Input MUX Selection bit 1 mask
.equ AC_MUXNEG_1_bp = 1                  ; Negative Input MUX Selection bit 1 position
.equ AC_MUXNEG_2_bm = (1<<2)             ; Negative Input MUX Selection bit 2 mask
.equ AC_MUXNEG_2_bp = 2                  ; Negative Input MUX Selection bit 2 position
.equ AC_MUXPOS_gm = 0x38                 ; Positive Input MUX Selection group mask
.equ AC_MUXPOS_gp = 3                    ; Positive Input MUX Selection group position
.equ AC_MUXPOS_0_bm = (1<<3)             ; Positive Input MUX Selection bit 0 mask
.equ AC_MUXPOS_0_bp = 3                  ; Positive Input MUX Selection bit 0 position
.equ AC_MUXPOS_1_bm = (1<<4)             ; Positive Input MUX Selection bit 1 mask
.equ AC_MUXPOS_1_bp = 4                  ; Positive Input MUX Selection bit 1 position
.equ AC_MUXPOS_2_bm = (1<<5)             ; Positive Input MUX Selection bit 2 mask
.equ AC_MUXPOS_2_bp = 5                  ; Positive Input MUX Selection bit 2 position
.equ AC_INITVAL_bm = 0x40                ; AC Output Initial Value bit mask
.equ AC_INITVAL_bp = 6                   ; AC Output Initial Value bit position
.equ AC_INVERT_bm = 0x80                 ; Invert AC Output bit mask
.equ AC_INVERT_bp = 7                    ; Invert AC Output bit position

